test-stress-results/k6-stress-golang-io-results.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: /stress.js
     output: -

  scenarios: (100.00%) 1 scenario, 30 max VUs, 3m0s max duration (incl. graceful stop):
           * default: Up to 30 looping VUs for 2m30s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/30 VUs, 6 complete and 0 interrupted iterations
default   [   1% ] 01/30 VUs  0m01.0s/2m30.0s

running (0m02.0s), 01/30 VUs, 12 complete and 0 interrupted iterations
default   [   1% ] 01/30 VUs  0m02.0s/2m30.0s

running (0m03.0s), 01/30 VUs, 19 complete and 0 interrupted iterations
default   [   2% ] 01/30 VUs  0m03.0s/2m30.0s

running (0m04.0s), 02/30 VUs, 29 complete and 0 interrupted iterations
default   [   3% ] 02/30 VUs  0m04.0s/2m30.0s

running (0m05.0s), 02/30 VUs, 42 complete and 0 interrupted iterations
default   [   3% ] 02/30 VUs  0m05.0s/2m30.0s

running (0m06.0s), 02/30 VUs, 55 complete and 0 interrupted iterations
default   [   4% ] 02/30 VUs  0m06.0s/2m30.0s

running (0m07.0s), 03/30 VUs, 70 complete and 0 interrupted iterations
default   [   5% ] 03/30 VUs  0m07.0s/2m30.0s

running (0m08.0s), 03/30 VUs, 89 complete and 0 interrupted iterations
default   [   5% ] 03/30 VUs  0m08.0s/2m30.0s

running (0m09.0s), 03/30 VUs, 109 complete and 0 interrupted iterations
default   [   6% ] 03/30 VUs  0m09.0s/2m30.0s

running (0m10.0s), 03/30 VUs, 127 complete and 0 interrupted iterations
default   [   7% ] 03/30 VUs  0m10.0s/2m30.0s

running (0m11.0s), 04/30 VUs, 152 complete and 0 interrupted iterations
default   [   7% ] 04/30 VUs  0m11.0s/2m30.0s

running (0m12.0s), 04/30 VUs, 178 complete and 0 interrupted iterations
default   [   8% ] 04/30 VUs  0m12.0s/2m30.0s

running (0m13.0s), 04/30 VUs, 204 complete and 0 interrupted iterations
default   [   9% ] 04/30 VUs  0m13.0s/2m30.0s

running (0m14.0s), 05/30 VUs, 232 complete and 0 interrupted iterations
default   [   9% ] 05/30 VUs  0m14.0s/2m30.0s

running (0m15.0s), 05/30 VUs, 264 complete and 0 interrupted iterations
default   [  10% ] 05/30 VUs  0m15.0s/2m30.0s

running (0m16.0s), 05/30 VUs, 296 complete and 0 interrupted iterations
default   [  11% ] 05/30 VUs  0m16.0s/2m30.0s

running (0m17.0s), 06/30 VUs, 331 complete and 0 interrupted iterations
default   [  11% ] 06/30 VUs  0m17.0s/2m30.0s

running (0m18.0s), 06/30 VUs, 367 complete and 0 interrupted iterations
default   [  12% ] 06/30 VUs  0m18.0s/2m30.0s

running (0m19.0s), 06/30 VUs, 403 complete and 0 interrupted iterations
default   [  13% ] 06/30 VUs  0m19.0s/2m30.0s

running (0m20.0s), 06/30 VUs, 445 complete and 0 interrupted iterations
default   [  13% ] 06/30 VUs  0m20.0s/2m30.0s

running (0m21.0s), 07/30 VUs, 487 complete and 0 interrupted iterations
default   [  14% ] 07/30 VUs  0m21.0s/2m30.0s

running (0m22.0s), 07/30 VUs, 534 complete and 0 interrupted iterations
default   [  15% ] 07/30 VUs  0m22.0s/2m30.0s

running (0m23.0s), 07/30 VUs, 578 complete and 0 interrupted iterations
default   [  15% ] 07/30 VUs  0m23.0s/2m30.0s

running (0m24.0s), 08/30 VUs, 621 complete and 0 interrupted iterations
default   [  16% ] 08/30 VUs  0m24.0s/2m30.0s

running (0m25.0s), 08/30 VUs, 670 complete and 0 interrupted iterations
default   [  17% ] 08/30 VUs  0m25.0s/2m30.0s

running (0m26.0s), 08/30 VUs, 721 complete and 0 interrupted iterations
default   [  17% ] 08/30 VUs  0m26.0s/2m30.0s

running (0m27.0s), 09/30 VUs, 776 complete and 0 interrupted iterations
default   [  18% ] 09/30 VUs  0m27.0s/2m30.0s

running (0m28.0s), 09/30 VUs, 831 complete and 0 interrupted iterations
default   [  19% ] 09/30 VUs  0m28.0s/2m30.0s

running (0m29.0s), 09/30 VUs, 887 complete and 0 interrupted iterations
default   [  19% ] 09/30 VUs  0m29.0s/2m30.0s

running (0m30.0s), 09/30 VUs, 935 complete and 0 interrupted iterations
default   [  20% ] 09/30 VUs  0m30.0s/2m30.0s

running (0m31.0s), 10/30 VUs, 976 complete and 0 interrupted iterations
default   [  21% ] 10/30 VUs  0m31.0s/2m30.0s

running (0m32.0s), 10/30 VUs, 1030 complete and 0 interrupted iterations
default   [  21% ] 10/30 VUs  0m32.0s/2m30.0s

running (0m32.9s), 10/30 VUs, 1076 complete and 0 interrupted iterations
default   [  22% ] 10/30 VUs  0m33.0s/2m30.0s

running (0m33.9s), 11/30 VUs, 1142 complete and 0 interrupted iterations
default   [  23% ] 11/30 VUs  0m34.0s/2m30.0s

running (0m34.9s), 11/30 VUs, 1199 complete and 0 interrupted iterations
default   [  23% ] 11/30 VUs  0m35.0s/2m30.0s

running (0m35.9s), 11/30 VUs, 1267 complete and 0 interrupted iterations
default   [  24% ] 11/30 VUs  0m36.0s/2m30.0s

running (0m36.9s), 12/30 VUs, 1328 complete and 0 interrupted iterations
default   [  25% ] 12/30 VUs  0m37.0s/2m30.0s

running (0m37.9s), 12/30 VUs, 1388 complete and 0 interrupted iterations
default   [  25% ] 12/30 VUs  0m38.0s/2m30.0s

running (0m38.9s), 12/30 VUs, 1437 complete and 0 interrupted iterations
default   [  26% ] 12/30 VUs  0m39.0s/2m30.0s

running (0m39.9s), 13/30 VUs, 1495 complete and 0 interrupted iterations
default   [  27% ] 13/30 VUs  0m40.0s/2m30.0s

running (0m40.9s), 13/30 VUs, 1555 complete and 0 interrupted iterations
default   [  27% ] 13/30 VUs  0m41.0s/2m30.0s

running (0m41.9s), 13/30 VUs, 1607 complete and 0 interrupted iterations
default   [  28% ] 13/30 VUs  0m42.0s/2m30.0s

running (0m42.9s), 14/30 VUs, 1667 complete and 0 interrupted iterations
default   [  29% ] 14/30 VUs  0m43.0s/2m30.0s

running (0m43.9s), 14/30 VUs, 1741 complete and 0 interrupted iterations
default   [  29% ] 14/30 VUs  0m44.0s/2m30.0s

running (0m44.9s), 14/30 VUs, 1804 complete and 0 interrupted iterations
default   [  30% ] 14/30 VUs  0m45.0s/2m30.0s

running (0m45.9s), 15/30 VUs, 1871 complete and 0 interrupted iterations
default   [  31% ] 15/30 VUs  0m46.0s/2m30.0s

running (0m46.9s), 15/30 VUs, 1931 complete and 0 interrupted iterations
default   [  31% ] 15/30 VUs  0m47.0s/2m30.0s

running (0m47.9s), 15/30 VUs, 2007 complete and 0 interrupted iterations
default   [  32% ] 15/30 VUs  0m48.0s/2m30.0s

running (0m48.9s), 16/30 VUs, 2066 complete and 0 interrupted iterations
default   [  33% ] 16/30 VUs  0m49.0s/2m30.0s

running (0m49.9s), 16/30 VUs, 2124 complete and 0 interrupted iterations
default   [  33% ] 16/30 VUs  0m50.0s/2m30.0s

running (0m50.9s), 16/30 VUs, 2206 complete and 0 interrupted iterations
default   [  34% ] 16/30 VUs  0m51.0s/2m30.0s

running (0m51.9s), 17/30 VUs, 2294 complete and 0 interrupted iterations
default   [  35% ] 17/30 VUs  0m52.0s/2m30.0s

running (0m52.9s), 17/30 VUs, 2356 complete and 0 interrupted iterations
default   [  35% ] 17/30 VUs  0m53.0s/2m30.0s

running (0m53.9s), 17/30 VUs, 2424 complete and 0 interrupted iterations
default   [  36% ] 17/30 VUs  0m54.0s/2m30.0s

running (0m54.9s), 18/30 VUs, 2503 complete and 0 interrupted iterations
default   [  37% ] 18/30 VUs  0m55.0s/2m30.0s

running (0m55.9s), 18/30 VUs, 2581 complete and 0 interrupted iterations
default   [  37% ] 18/30 VUs  0m56.0s/2m30.0s

running (0m56.9s), 18/30 VUs, 2631 complete and 0 interrupted iterations
default   [  38% ] 18/30 VUs  0m57.0s/2m30.0s

running (0m57.9s), 19/30 VUs, 2695 complete and 0 interrupted iterations
default   [  39% ] 19/30 VUs  0m58.0s/2m30.0s

running (0m58.9s), 19/30 VUs, 2777 complete and 0 interrupted iterations
default   [  39% ] 19/30 VUs  0m59.0s/2m30.0s

running (0m59.9s), 19/30 VUs, 2849 complete and 0 interrupted iterations
default   [  40% ] 19/30 VUs  1m00.0s/2m30.0s

running (1m00.9s), 20/30 VUs, 2918 complete and 0 interrupted iterations
default   [  41% ] 20/30 VUs  1m01.0s/2m30.0s

running (1m01.9s), 20/30 VUs, 2983 complete and 0 interrupted iterations
default   [  41% ] 20/30 VUs  1m02.0s/2m30.0s

running (1m02.9s), 20/30 VUs, 3036 complete and 0 interrupted iterations
default   [  42% ] 20/30 VUs  1m03.0s/2m30.0s

running (1m03.9s), 20/30 VUs, 3123 complete and 0 interrupted iterations
default   [  43% ] 20/30 VUs  1m04.0s/2m30.0s

running (1m04.9s), 20/30 VUs, 3204 complete and 0 interrupted iterations
default   [  43% ] 20/30 VUs  1m05.0s/2m30.0s

running (1m05.9s), 20/30 VUs, 3252 complete and 0 interrupted iterations
default   [  44% ] 20/30 VUs  1m06.0s/2m30.0s

running (1m06.9s), 21/30 VUs, 3306 complete and 0 interrupted iterations
default   [  45% ] 21/30 VUs  1m07.0s/2m30.0s

running (1m07.9s), 21/30 VUs, 3361 complete and 0 interrupted iterations
default   [  45% ] 21/30 VUs  1m08.0s/2m30.0s

running (1m08.9s), 21/30 VUs, 3424 complete and 0 interrupted iterations
default   [  46% ] 21/30 VUs  1m09.0s/2m30.0s

running (1m09.9s), 21/30 VUs, 3488 complete and 0 interrupted iterations
default   [  47% ] 21/30 VUs  1m10.0s/2m30.0s

running (1m10.9s), 21/30 VUs, 3541 complete and 0 interrupted iterations
default   [  47% ] 21/30 VUs  1m11.0s/2m30.0s

running (1m11.9s), 21/30 VUs, 3602 complete and 0 interrupted iterations
default   [  48% ] 21/30 VUs  1m12.0s/2m30.0s

running (1m12.9s), 22/30 VUs, 3646 complete and 0 interrupted iterations
default   [  49% ] 22/30 VUs  1m13.0s/2m30.0s

running (1m13.9s), 22/30 VUs, 3707 complete and 0 interrupted iterations
default   [  49% ] 22/30 VUs  1m14.0s/2m30.0s

running (1m14.9s), 22/30 VUs, 3783 complete and 0 interrupted iterations
default   [  50% ] 22/30 VUs  1m15.0s/2m30.0s

running (1m15.9s), 22/30 VUs, 3844 complete and 0 interrupted iterations
default   [  51% ] 22/30 VUs  1m16.0s/2m30.0s

running (1m16.9s), 22/30 VUs, 3911 complete and 0 interrupted iterations
default   [  51% ] 22/30 VUs  1m17.0s/2m30.0s

running (1m17.9s), 22/30 VUs, 3985 complete and 0 interrupted iterations
default   [  52% ] 22/30 VUs  1m18.0s/2m30.0s

running (1m18.9s), 23/30 VUs, 4057 complete and 0 interrupted iterations
default   [  53% ] 23/30 VUs  1m19.0s/2m30.0s

running (1m19.9s), 23/30 VUs, 4119 complete and 0 interrupted iterations
default   [  53% ] 23/30 VUs  1m20.0s/2m30.0s

running (1m20.9s), 23/30 VUs, 4180 complete and 0 interrupted iterations
default   [  54% ] 23/30 VUs  1m21.0s/2m30.0s

running (1m21.9s), 23/30 VUs, 4235 complete and 0 interrupted iterations
default   [  55% ] 23/30 VUs  1m22.0s/2m30.0s

running (1m22.9s), 23/30 VUs, 4290 complete and 0 interrupted iterations
default   [  55% ] 23/30 VUs  1m23.0s/2m30.0s

running (1m23.9s), 23/30 VUs, 4342 complete and 0 interrupted iterations
default   [  56% ] 23/30 VUs  1m24.0s/2m30.0s

running (1m24.9s), 24/30 VUs, 4409 complete and 0 interrupted iterations
default   [  57% ] 24/30 VUs  1m25.0s/2m30.0s

running (1m25.9s), 24/30 VUs, 4498 complete and 0 interrupted iterations
default   [  57% ] 24/30 VUs  1m26.0s/2m30.0s

running (1m26.9s), 24/30 VUs, 4590 complete and 0 interrupted iterations
default   [  58% ] 24/30 VUs  1m27.0s/2m30.0s

running (1m27.9s), 24/30 VUs, 4662 complete and 0 interrupted iterations
default   [  59% ] 24/30 VUs  1m28.0s/2m30.0s

running (1m28.9s), 24/30 VUs, 4740 complete and 0 interrupted iterations
default   [  59% ] 24/30 VUs  1m29.0s/2m30.0s

running (1m29.9s), 24/30 VUs, 4787 complete and 0 interrupted iterations
default   [  60% ] 24/30 VUs  1m30.0s/2m30.0s

running (1m30.9s), 25/30 VUs, 4863 complete and 0 interrupted iterations
default   [  61% ] 25/30 VUs  1m31.0s/2m30.0s

running (1m31.9s), 25/30 VUs, 4940 complete and 0 interrupted iterations
default   [  61% ] 25/30 VUs  1m32.0s/2m30.0s

running (1m32.9s), 25/30 VUs, 4991 complete and 0 interrupted iterations
default   [  62% ] 25/30 VUs  1m33.0s/2m30.0s

running (1m33.9s), 25/30 VUs, 5054 complete and 0 interrupted iterations
default   [  63% ] 25/30 VUs  1m34.0s/2m30.0s

running (1m34.9s), 25/30 VUs, 5126 complete and 0 interrupted iterations
default   [  63% ] 25/30 VUs  1m35.0s/2m30.0s

running (1m35.9s), 25/30 VUs, 5205 complete and 0 interrupted iterations
default   [  64% ] 25/30 VUs  1m36.0s/2m30.0s

running (1m36.9s), 26/30 VUs, 5262 complete and 0 interrupted iterations
default   [  65% ] 26/30 VUs  1m37.0s/2m30.0s

running (1m37.9s), 26/30 VUs, 5330 complete and 0 interrupted iterations
default   [  65% ] 26/30 VUs  1m38.0s/2m30.0s

running (1m38.9s), 26/30 VUs, 5399 complete and 0 interrupted iterations
default   [  66% ] 26/30 VUs  1m39.0s/2m30.0s

running (1m39.9s), 26/30 VUs, 5447 complete and 0 interrupted iterations
default   [  67% ] 26/30 VUs  1m40.0s/2m30.0s

running (1m40.9s), 26/30 VUs, 5528 complete and 0 interrupted iterations
default   [  67% ] 26/30 VUs  1m41.0s/2m30.0s

running (1m41.9s), 26/30 VUs, 5600 complete and 0 interrupted iterations
default   [  68% ] 26/30 VUs  1m42.0s/2m30.0s

running (1m42.9s), 27/30 VUs, 5677 complete and 0 interrupted iterations
default   [  69% ] 27/30 VUs  1m43.0s/2m30.0s

running (1m43.9s), 27/30 VUs, 5733 complete and 0 interrupted iterations
default   [  69% ] 27/30 VUs  1m44.0s/2m30.0s

running (1m44.9s), 27/30 VUs, 5812 complete and 0 interrupted iterations
default   [  70% ] 27/30 VUs  1m45.0s/2m30.0s

running (1m45.9s), 27/30 VUs, 5881 complete and 0 interrupted iterations
default   [  71% ] 27/30 VUs  1m46.0s/2m30.0s

running (1m46.9s), 27/30 VUs, 5959 complete and 0 interrupted iterations
default   [  71% ] 27/30 VUs  1m47.0s/2m30.0s

running (1m47.9s), 27/30 VUs, 6035 complete and 0 interrupted iterations
default   [  72% ] 27/30 VUs  1m48.0s/2m30.0s

running (1m48.9s), 28/30 VUs, 6115 complete and 0 interrupted iterations
default   [  73% ] 28/30 VUs  1m49.0s/2m30.0s

running (1m49.9s), 28/30 VUs, 6168 complete and 0 interrupted iterations
default   [  73% ] 28/30 VUs  1m50.0s/2m30.0s

running (1m50.9s), 28/30 VUs, 6297 complete and 0 interrupted iterations
default   [  74% ] 28/30 VUs  1m51.0s/2m30.0s

running (1m51.9s), 28/30 VUs, 6364 complete and 0 interrupted iterations
default   [  75% ] 28/30 VUs  1m52.0s/2m30.0s

running (1m52.9s), 28/30 VUs, 6428 complete and 0 interrupted iterations
default   [  75% ] 28/30 VUs  1m53.0s/2m30.0s

running (1m53.9s), 28/30 VUs, 6508 complete and 0 interrupted iterations
default   [  76% ] 28/30 VUs  1m54.0s/2m30.0s

running (1m54.9s), 29/30 VUs, 6572 complete and 0 interrupted iterations
default   [  77% ] 29/30 VUs  1m55.0s/2m30.0s

running (1m55.9s), 29/30 VUs, 6646 complete and 0 interrupted iterations
default   [  77% ] 29/30 VUs  1m56.0s/2m30.0s

running (1m56.9s), 29/30 VUs, 6724 complete and 0 interrupted iterations
default   [  78% ] 29/30 VUs  1m57.0s/2m30.0s

running (1m57.9s), 29/30 VUs, 6805 complete and 0 interrupted iterations
default   [  79% ] 29/30 VUs  1m58.0s/2m30.0s

running (1m58.9s), 29/30 VUs, 6866 complete and 0 interrupted iterations
default   [  79% ] 29/30 VUs  1m59.0s/2m30.0s

running (1m59.9s), 29/30 VUs, 6952 complete and 0 interrupted iterations
default   [  80% ] 29/30 VUs  2m00.0s/2m30.0s

running (2m00.9s), 30/30 VUs, 7031 complete and 0 interrupted iterations
default   [  81% ] 30/30 VUs  2m01.0s/2m30.0s

running (2m01.9s), 29/30 VUs, 7093 complete and 0 interrupted iterations
default   [  81% ] 29/30 VUs  2m02.0s/2m30.0s

running (2m02.9s), 28/30 VUs, 7186 complete and 0 interrupted iterations
default   [  82% ] 28/30 VUs  2m03.0s/2m30.0s

running (2m03.9s), 27/30 VUs, 7277 complete and 0 interrupted iterations
default   [  83% ] 27/30 VUs  2m04.0s/2m30.0s

running (2m04.9s), 26/30 VUs, 7358 complete and 0 interrupted iterations
default   [  83% ] 26/30 VUs  2m05.0s/2m30.0s

running (2m05.9s), 25/30 VUs, 7451 complete and 0 interrupted iterations
default   [  84% ] 25/30 VUs  2m06.0s/2m30.0s

running (2m06.9s), 24/30 VUs, 7514 complete and 0 interrupted iterations
default   [  85% ] 24/30 VUs  2m07.0s/2m30.0s

running (2m07.9s), 23/30 VUs, 7593 complete and 0 interrupted iterations
default   [  85% ] 23/30 VUs  2m08.0s/2m30.0s

running (2m08.9s), 22/30 VUs, 7658 complete and 0 interrupted iterations
default   [  86% ] 22/30 VUs  2m09.0s/2m30.0s

running (2m09.9s), 21/30 VUs, 7727 complete and 0 interrupted iterations
default   [  87% ] 21/30 VUs  2m10.0s/2m30.0s

running (2m10.9s), 20/30 VUs, 7797 complete and 0 interrupted iterations
default   [  87% ] 20/30 VUs  2m11.0s/2m30.0s

running (2m11.9s), 19/30 VUs, 7855 complete and 0 interrupted iterations
default   [  88% ] 19/30 VUs  2m12.0s/2m30.0s

running (2m12.9s), 18/30 VUs, 7921 complete and 0 interrupted iterations
default   [  89% ] 18/30 VUs  2m13.0s/2m30.0s

running (2m13.9s), 17/30 VUs, 7991 complete and 0 interrupted iterations
default   [  89% ] 17/30 VUs  2m14.0s/2m30.0s

running (2m14.9s), 16/30 VUs, 8074 complete and 0 interrupted iterations
default   [  90% ] 16/30 VUs  2m15.0s/2m30.0s

running (2m15.9s), 15/30 VUs, 8145 complete and 0 interrupted iterations
default   [  91% ] 15/30 VUs  2m16.0s/2m30.0s

running (2m16.9s), 14/30 VUs, 8207 complete and 0 interrupted iterations
default   [  91% ] 14/30 VUs  2m17.0s/2m30.0s

running (2m17.9s), 13/30 VUs, 8277 complete and 0 interrupted iterations
default   [  92% ] 13/30 VUs  2m18.0s/2m30.0s

running (2m18.9s), 12/30 VUs, 8338 complete and 0 interrupted iterations
default   [  93% ] 12/30 VUs  2m19.0s/2m30.0s

running (2m19.9s), 11/30 VUs, 8394 complete and 0 interrupted iterations
default   [  93% ] 11/30 VUs  2m20.0s/2m30.0s

running (2m20.9s), 10/30 VUs, 8439 complete and 0 interrupted iterations
default   [  94% ] 10/30 VUs  2m21.0s/2m30.0s

running (2m21.9s), 09/30 VUs, 8486 complete and 0 interrupted iterations
default   [  95% ] 09/30 VUs  2m22.0s/2m30.0s

running (2m22.9s), 08/30 VUs, 8531 complete and 0 interrupted iterations
default   [  95% ] 08/30 VUs  2m23.0s/2m30.0s

running (2m23.9s), 07/30 VUs, 8574 complete and 0 interrupted iterations
default   [  96% ] 07/30 VUs  2m24.0s/2m30.0s

running (2m24.9s), 06/30 VUs, 8611 complete and 0 interrupted iterations
default   [  97% ] 06/30 VUs  2m25.0s/2m30.0s

running (2m25.9s), 05/30 VUs, 8642 complete and 0 interrupted iterations
default   [  97% ] 05/30 VUs  2m26.0s/2m30.0s

running (2m26.9s), 04/30 VUs, 8667 complete and 0 interrupted iterations
default   [  98% ] 04/30 VUs  2m27.0s/2m30.0s

running (2m27.9s), 03/30 VUs, 8689 complete and 0 interrupted iterations
default   [  99% ] 03/30 VUs  2m28.0s/2m30.0s

running (2m28.9s), 02/30 VUs, 8702 complete and 0 interrupted iterations
default   [  99% ] 02/30 VUs  2m29.0s/2m30.0s

running (2m29.9s), 01/30 VUs, 8710 complete and 0 interrupted iterations
default   [ 100% ] 01/30 VUs  2m30.0s/2m30.0s

     data_received..................: 1.0 MB 6.8 kB/s
     data_sent......................: 906 kB 6.0 kB/s
     http_req_blocked...............: avg=87.46µs  min=6.25µs   med=25.29µs  max=74.45ms  p(90)=38.92µs  p(95)=85.89µs 
     http_req_connecting............: avg=2.81µs   min=0s       med=0s       max=2.15ms   p(90)=0s       p(95)=0s      
   ✓ http_req_duration..............: avg=184.07ms min=18.56ms  med=120.65ms max=1.38s    p(90)=391.96ms p(95)=495.36ms
       { expected_response:true }...: avg=184.07ms min=18.56ms  med=120.65ms max=1.38s    p(90)=391.96ms p(95)=495.36ms
   ✓ http_req_failed................: 0.00%  ✓ 0         ✗ 8711
     http_req_receiving.............: avg=577.12µs min=25.7µs   med=176.66µs max=107.79ms p(90)=594.67µs p(95)=1.87ms  
     http_req_sending...............: avg=277.01µs min=15.56µs  med=62.91µs  max=78.53ms  p(90)=184.62µs p(95)=609.16µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=183.21ms min=18.12ms  med=119.46ms max=1.38s    p(90)=390.04ms p(95)=494.94ms
     http_reqs......................: 8711   58.036555/s
     iteration_duration.............: avg=289.46ms min=151.02ms med=229.38ms max=1.48s    p(90)=496.47ms p(95)=601.54ms
     iterations.....................: 8711   58.036555/s
     vus............................: 1      min=1       max=30
     vus_max........................: 30     min=30      max=30


running (2m30.1s), 00/30 VUs, 8711 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/30 VUs  2m30s